This change is applied:

```
Terraform will perform the following actions:

  # module.code_coverage.aws_cloudfront_distribution.website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website" {
        id                             = "E1UPA1VITC8UN5"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          + response_headers_policy_id = (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.code_coverage.aws_cloudfront_response_headers_policy.website will be created
  + resource "aws_cloudfront_response_headers_policy" "website" {
      + comment = "static website codecov.artichokeruby.org"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "cloudfront-codecov-artichokeruby-org-response-headers"

      + custom_headers_config {
          + items {
              + header   = "cache-control"
              + override = true
              + value    = "no-cache"
            }
        }

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "frame-ancestors 'none'; style-src 'self' https://cdn.jsdelivr.net/ 'nonce-b77e5ce9ed'; img-src 'self'; object-src 'none'; script-src 'none'; trusted-types; require-trusted-types-for 'script';"
              + override                = true
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }

          + referrer_policy {
              + override        = true
              + referrer_policy = "no-referrer"
            }

          + strict_transport_security {
              + access_control_max_age_sec = 63072000
              + include_subdomains         = false
              + override                   = true
              + preload                    = false
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.code_coverage.aws_cloudfront_response_headers_policy.website: Creating...
module.code_coverage.aws_cloudfront_response_headers_policy.website: Creation complete after 0s [id=c5c7973e-75db-4a23-9a42-19ed0aa811e6]
module.code_coverage.aws_cloudfront_distribution.website: Modifying... [id=E1UPA1VITC8UN5]
module.code_coverage.aws_cloudfront_distribution.website: Modifications complete after 1s [id=E1UPA1VITC8UN5]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
```